[
  {
    "title": "Thai SEC Seeks Operators for Digital Asset Payment Scheme",
    "link": "https://fintechnews.sg/119371/thailand/thai-touristdigipay/",
    "guid": "https://fintechnews.sg/?p=119371",
    "pubDate": "2025-09-29T09:22:36.000Z",
    "author": "Fintech News Singapore",
    "categories": [
      "Digital Assets",
      "Thailand",
      "Securities and Exchange Commission"
    ],
    "contentHtml": "<p>The Securities and Exchange Commission (SEC) has launched the TouristDigiPay sandbox, a pilot programme to let foreign tourists convert digital assets into Thai Baht for payments on goods and services in Thailand.</p>\n<p>Applications from digital asset business operators and e-money service providers opened on 25 September 2025.</p>\n<p>TouristDigiPay is designed to test the conversion of digital assets into Thai Baht for foreign tourists, supporting innovation, promoting economic growth and strengthening Thailand’s tourism sector.</p>\n<p>Regulations for the project took effect on 24 September 2025 after being published in the Government Gazette.</p>\n<p>Licensed digital asset exchanges, brokers or dealers that integrate with e-money service providers can apply, provided they are ready to operate under the format and criteria set by the SEC.</p>\n<p>Participants must obtain SEC approval before offering services, which are limited to foreign tourists temporarily residing in Thailand.</p>\n<p>They are required to enable spending via Thai QR code scanning, conduct identity verification in line with Anti-Money Laundering Office rules and only facilitate transactions in line with their licensed categories.</p>\n<p>Applicants must also submit required data to the SEC, verify the source of digital assets exchanged into Thai Baht, report information regularly and maintain an exit strategy in case of withdrawal from the project.</p>\n<p>Applications will be accepted until 26 December 2025. Details are available on the SEC website or emailing <a href=\"mailto:dassec@sec.or.th\" target=\"_blank\" rel=\"noopener\">dassec@sec.or.th</a>.</p>\n<p>Services under the project are expected to begin in the fourth quarter of 2025.</p>\n<p>Anek Yooyuen, SEC Deputy Secretary-General and spokesperson, said,</p>\n<blockquote><p>“The TouristDigiPay sandbox is made possible thanks to collaboration from many regulatory agencies. The SEC supports technological development and innovation aimed at enhancing competitiveness.</p>\n<p>We believe this project will facilitate convenient spending through Thai QR Code scanning, promote Thailand’s digital economy, and distribute income across communities and localities, while effectively managing potential risks at appropriate levels.”</p></blockquote>\n<p>&nbsp;</p>\n<p>&nbsp;</p>\n\n\n",
    "originImg": "https://www.freepik.com/free-photo/hand-holding-smartphone-with-blank-screen-blurred-city-background_273922125.htm"
  },
  {
    "title": "Swift to Build Blockchain Network With Global Banks for 24/7 Payments",
    "link": "https://fintechnews.sg/119397/blockchain/swift-blockchain-payments/",
    "guid": "https://fintechnews.sg/?p=119397",
    "pubDate": "2025-09-29T09:03:28.000Z",
    "author": "Fintech News Singapore",
    "categories": [
      "Blockchain",
      "Payments",
      "SWIFT"
    ],
    "contentHtml": "<p><a href=\"https://fintechnews.sg/tag/Swift/\" target=\"_blank\" rel=\"noopener\">Swift</a> is teaming up with more than 30 banks to build a blockchain ledger aimed at turning cross-border payments into a real-time, always-on service.</p>\n<p>The network said it is working with financial institutions from 16 countries to design the system, starting with a conceptual prototype developed with Consensys.</p>\n<p>Swift plans to complete this first phase quickly and define later phases once the proof of concept is complete.</p>\n<p>The shared ledger will record, sequence and validate transactions using smart contracts and will be built for interoperability with both established and emerging networks.</p>\n<p>It is intended to let banks move regulated tokenised value securely and at scale, while commercial and central banks decide which tokenised assets will flow across it.</p>\n<p>Participating banks include Absa, Akbank, ANZ, Banco Santander, Bank of America, Banorte, BBVA, BNP Paribas, BNY, Bradesco, Citi, Commerzbank, Crédit Agricole, DBS Bank, Deutsche Bank, Emirates NBD, First Abu Dhabi Bank, FirstRand Bank, HSBC, Itaú Unibanco, JP Morgan Chase, Mizuho, MUFG, NatWest, OCBC, Royal Bank of Canada, Saudi Awwal Bank, Shinhan Bank, Societe Generale-FORGE, Standard Chartered, TD Bank Group, UOB, Wells Fargo and Westpac.</p>\n<p>Swift also plans new services to connect digital and traditional systems, building on earlier pilots to coordinate transactions across private and public networks for synchronised settlement and liquidity optimisation.</p>\n<p>The initiative was announced at the Sibos conference in Frankfurt as part of Swift’s broader strategy to upgrade its current payment rails while developing future digital infrastructure.</p>\n<p>Last week, Swift also said it is <a href=\"https://fintechnews.sg/119345/payments/swift-cross-border-payments/\" target=\"_blank\" rel=\"noopener\">drafting new scheme rules</a> for its existing systems to make transfers faster and more predictable for consumers and small businesses.</p>\n<p>According to Swift, the ledger builds on two years of live digital asset trials and its neutral position in the global payments system to help banks adopt blockchain at scale.</p>\n<p>Financial institutions are providing feedback on the design ahead of wider implementation.</p>\n<figure id=\"attachment_119401\" aria-describedby=\"caption-attachment-119401\" style=\"width: 150px\" class=\"wp-caption alignleft\"><img decoding=\"async\" class=\"size-thumbnail wp-image-119401\" src=\"https://fintechnews.sg/wp-content/uploads/2025/09/Javier-Perez-Tasso-150x150.jpg\" alt=\"Javier Pérez-Tasso\" width=\"150\" height=\"150\" srcset=\"https://fintechnews.sg/wp-content/uploads/2025/09/Javier-Perez-Tasso-150x150.jpg 150w, https://fintechnews.sg/wp-content/uploads/2025/09/Javier-Perez-Tasso-300x300.jpg 300w, https://fintechnews.sg/wp-content/uploads/2025/09/Javier-Perez-Tasso-450x450.jpg 450w, https://fintechnews.sg/wp-content/uploads/2025/09/Javier-Perez-Tasso-96x96.jpg 96w, https://fintechnews.sg/wp-content/uploads/2025/09/Javier-Perez-Tasso.jpg 480w\" sizes=\"(max-width: 150px) 100vw, 150px\"><figcaption id=\"caption-attachment-119401\" class=\"wp-caption-text\">Javier Pérez-Tasso</figcaption></figure>\n<p>Swift CEO Javier Pérez-Tasso said,</p>\n<blockquote><p>“We provide powerful and effective rails today and are moving at a rapid pace with our community to create the infrastructure stack of the future.</p>\n<p>Through this initial ledger concept we are paving the way for financial institutions to take the payments experience to the next level with Swift’s proven and trusted platform at the centre of the industry’s digital transformation.”</p></blockquote>\n<p>&nbsp;</p>\n<p>&nbsp;</p>\n\n<p>&nbsp;</p>\n\n",
    "originImg": "https://www.freepik.com/premium-ai-image/blurry-office-hallway_138731229.htm"
  },
  {
    "title": "Temenos Unifies Payments, Risk, and Treasury in New AI-Driven Platform",
    "link": "https://fintechnews.sg/119392/ai/temenos-ai-payments/",
    "guid": "https://fintechnews.sg/?p=119392",
    "pubDate": "2025-09-29T08:37:48.000Z",
    "author": "Fintech News Singapore",
    "categories": [
      "AI",
      "Payments",
      "Temenos"
    ],
    "contentHtml": "<p>Banking software company <a href=\"https://fintechnews.sg/tag/Temenos/\" target=\"_blank\" rel=\"noopener\">Temenos</a> introduces a unified platform that uses AI to streamline payments, cut costs and enhance real-time screening for financial institutions.</p>\n<p>The new <a href=\"https://www.temenos.com/products/payments/money-movement-management/\" target=\"_blank\" rel=\"noopener\">Money Movement &amp; Management</a> system unites payments, accounts, risk and treasury modules in one place to move money faster and more reliably.</p>\n<p>The platform helps new entrants launch services quickly while allowing established players to replace fragmented systems.</p>\n<p>Its AI tools include automated payment repair, fraud detection and copilot features to minimise manual intervention and improve straight-through processing.</p>\n<p>Temenos’ FCM AI Agent is built in to boost real-time screening and cut false positives.</p>\n<p>Integration accelerators enable rapid onboarding of digital wallets and alternative payment networks such as Wise, Thunes, Mastercard Move, Visa Direct and Standard Chartered Scale.</p>\n<p>Temenos noted that FINCI, an electronic money institution regulated by the Bank of Lithuania, went live on the platform within four months.</p>\n<p>Industry analysts said the platform addresses long-standing challenges in payments where outdated systems slow innovation and customer service.</p>\n<p>FINCI’s chief executive added that the system supports the company’s growth by processing thousands of payment requests a second, onboarding new payment providers in weeks and ensuring a fast, flexible and reliable service.</p>\n<figure id=\"attachment_102059\" aria-describedby=\"caption-attachment-102059\" style=\"width: 150px\" class=\"wp-caption alignleft\"><img decoding=\"async\" class=\"size-thumbnail wp-image-102059\" src=\"https://fintechnews.sg/wp-content/uploads/2024/10/Barb-Morgan-150x150.jpg\" alt=\"Barb Morgan\" width=\"150\" height=\"150\" srcset=\"https://fintechnews.sg/wp-content/uploads/2024/10/Barb-Morgan-150x150.jpg 150w, https://fintechnews.sg/wp-content/uploads/2024/10/Barb-Morgan-300x300.jpg 300w, https://fintechnews.sg/wp-content/uploads/2024/10/Barb-Morgan-768x768.jpg 768w, https://fintechnews.sg/wp-content/uploads/2024/10/Barb-Morgan-450x450.jpg 450w, https://fintechnews.sg/wp-content/uploads/2024/10/Barb-Morgan-32x32.jpg 32w, https://fintechnews.sg/wp-content/uploads/2024/10/Barb-Morgan-48x48.jpg 48w, https://fintechnews.sg/wp-content/uploads/2024/10/Barb-Morgan-80x80.jpg 80w, https://fintechnews.sg/wp-content/uploads/2024/10/Barb-Morgan-180x180.jpg 180w, https://fintechnews.sg/wp-content/uploads/2024/10/Barb-Morgan.jpg 792w\" sizes=\"(max-width: 150px) 100vw, 150px\"><figcaption id=\"caption-attachment-102059\" class=\"wp-caption-text\">Barb Morgan</figcaption></figure>\n<p>Barb Morgan, Chief Product and Technology Officer at Temenos, said,</p>\n<blockquote><p>“With the rapid rise of instant payments and the growing influence of AI in financial services, institutions are actively seeking solutions that are both unified and intelligent to manage increasing complexity, compliance demands, and customer expectations.</p>\n<p>Temenos Money Movement &amp; Management directly addresses this market need, bringing together payments and account services in a single, AI-powered solution. Building on the success of Temenos Payments Hub, our leading and functionally rich payment hub used by banks worldwide, this new solution further strengthens our position as a trusted innovator in the payments space.”</p></blockquote>\n<p>Temenos said the platform is ISO 20022 and Open Banking ready, available globally as SaaS or for deployment on cloud, on-premises or hybrid environments.</p>\n<p>&nbsp;</p>\n<p>&nbsp;</p>\n\n\n",
    "originImg": "https://www.freepik.com/premium-photo/female-hands-using-mock-up-laptop-home-office-desk_9126817.htm"
  },
  {
    "title": "Singapore Maps Out Next Steps for Quantum-Safe Banking After Two-Phase Trial",
    "link": "https://fintechnews.sg/119379/security/mas-quantum-report/",
    "guid": "https://fintechnews.sg/?p=119379",
    "pubDate": "2025-09-29T08:17:23.000Z",
    "author": "Fintech News Singapore",
    "categories": [
      "Security",
      "DBS",
      "HSBC",
      "Monetary Authority of Singapore",
      "OCBC",
      "SpeQtral",
      "SPTel",
      "uob"
    ],
    "contentHtml": "<p>The <a href=\"https://fintechnews.sg/tag/Monetary-Authority-of-Singapore\" target=\"_blank\" rel=\"noopener\">Monetary Authority of Singapore (MAS)</a> and four major banks have tested quantum technology to protect critical financial data from future cyber threats and have now published the results.</p>\n<p>MAS worked with <a href=\"https://fintechnews.sg/tag/DBS\" target=\"_blank\" rel=\"noopener\">DBS</a>, <a href=\"https://fintechnews.sg/tag/HSBC\" target=\"_blank\" rel=\"noopener\">HSBC</a>, <a href=\"https://fintechnews.sg/tag/OCBC\" target=\"_blank\" rel=\"noopener\">OCBC</a>, <a href=\"https://fintechnews.sg/tag/UOB\" target=\"_blank\" rel=\"noopener\">UOB</a>, SPTel and SpeQtral to run a proof-of-concept sandbox in two phases.</p>\n<p>The first ran from September to November 2024 with DBS and OCBC, and the second from January to March 2025 with HSBC and UOB.</p>\n<p>The project trialled Quantum Key Distribution (QKD) on Singapore’s National Quantum-Safe Network Plus infrastructure to evaluate how it could secure sensitive data transfers between banks and the regulator.</p>\n<p>The sandbox deployed isolated QKD stacks to encrypt and decrypt settlement files between the banks and MAS, while measuring metrics such as Secure Key Rate and Quantum Bit Error Rate.</p>\n<p>It also simulated eavesdropping attacks and fibre disconnections.</p>\n<p>The system maintained secure operations during outages by drawing on a buffer of 6.75 million AES-256 keys per day, enough to sustain up to 2.5 months of encrypted operations.</p>\n<p>MAS and the banks tested advanced use cases including ML-DSA for digital signing, a hybrid VPN tunnel combining QKD with ML-KEM and Classic McEliece, and large-scale file transfers using one-time pad encryption.</p>\n<p>The technical report shows QKD’s potential to strengthen the security of inter-data centre links, critical payment systems and bank-to-regulator communications.</p>\n<p>It also identifies challenges including the need for stronger trusted node standards, greater interoperability between QKD providers and sustained senior management support to allocate budget, talent and resources to quantum-safe initiatives.</p>\n<p>Industry participants welcomed the findings, saying the project clarified security standards, implementation challenges and the integration of quantum-safe technology into existing financial infrastructure.</p>\n<p>MAS will continue collaborating with financial institutions and technology providers to develop frameworks, standards and implementation playbooks for quantum-safe communications.</p>\n<figure id=\"attachment_119383\" aria-describedby=\"caption-attachment-119383\" style=\"width: 150px\" class=\"wp-caption alignleft\"><img decoding=\"async\" class=\"size-thumbnail wp-image-119383\" src=\"https://fintechnews.sg/wp-content/uploads/2025/09/Vincent-Loy-150x150.jpg\" alt=\"Vincent Loy\" width=\"150\" height=\"150\" srcset=\"https://fintechnews.sg/wp-content/uploads/2025/09/Vincent-Loy-150x150.jpg 150w, https://fintechnews.sg/wp-content/uploads/2025/09/Vincent-Loy-96x96.jpg 96w\" sizes=\"(max-width: 150px) 100vw, 150px\"><figcaption id=\"caption-attachment-119383\" class=\"wp-caption-text\">Vincent Loy</figcaption></figure>\n<p>Vincent Loy, Assistant Managing Director (Technology) and Chief Technology Officer, MAS, said,</p>\n<blockquote><p>“MAS is committed to collaborating with the financial industry to trial promising cybersecurity technologies that can help to safeguard critical financial systems and data against emerging quantum threats. The QKD sandbox marks a significant step in exploring the potential use of quantum-safe solutions within IT systems and networks within the financial sector.</p>\n<p>The insights gained have enhanced our understanding of QKD technology, helped explore possible ways to strengthen the cyber resilience of Singapore’s financial sector, and uplifted the capabilities of financial institutions to respond to potential cybersecurity threats posed by quantum computing.”</p></blockquote>\n<p>&nbsp;</p>\n<p>&nbsp;</p>\n\n\n",
    "originImg": "https://www.freepik.com/premium-photo/close-up-view-young-man-holding-blank-screen-vertical-tablet-his-workspace_5827657.htm"
  },
  {
    "title": "Abigail Ng to Lead MAS as Its First Dedicated Chief Sustainability Officer",
    "link": "https://fintechnews.sg/119373/green-fintech/mas-chief-sustainability-officer/",
    "guid": "https://fintechnews.sg/?p=119373",
    "pubDate": "2025-09-29T07:57:20.000Z",
    "author": "Fintech News Singapore",
    "categories": [
      "Green Fintech",
      "Monetary Authority of Singapore (MAS)"
    ],
    "contentHtml": "<p>The <a href=\"https://fintechnews.sg/tag/Monetary-Authority-of-Singapore\" target=\"_blank\" rel=\"noopener\">Monetary Authority of Singapore (MAS)</a> will appoint Abigail Ng as its new Chief Sustainability Officer from 6 October 2025.</p>\n<p>She will take over from Gillian Tan, who has held the sustainability portfolio alongside her role as Assistant Managing Director for Development and International since October 2022.</p>\n<p>Tan will continue as Group Head of the Development and International Group.</p>\n<p>During Tan’s tenure, MAS advanced a suite of sustainability initiatives.</p>\n<p>These included the Finance for Net Zero Action Plan to mobilise financing for Asia’s low-carbon transition and the Singapore-Asia Taxonomy to align sustainable finance standards.</p>\n<p>MAS also launched the Transition Credits Coalition (TRACTION) and the Financing Asia’s Transition Partnership (FAST-P) to drive energy transition and blended finance in the region.</p>\n<p>It also introduced the Sustainable Finance Jobs Transformation Map to build sector skills.</p>\n<p>MAS said its sustainability agenda has reached a more mature stage, making it timely to appoint a dedicated Chief Sustainability Officer to lead the Sustainability Group.</p>\n<p>Ng, currently head of the Markets Policy and Consumer Department, has extensive experience working with international organisations and diverse stakeholders on sustainability disclosure policies and requirements.</p>\n<p>Her appointment underscores MAS’ intent to strengthen its leadership in sustainable finance and guide the sector through Asia’s transition to a low-carbon economy.</p>\n<p>&nbsp;</p>\n<p>&nbsp;</p>\n\n\n",
    "originImg": "https://www.freepik.com/premium-ai-image/bokeh-photo-blurred-interior-modern-office-space-business-banner-background-copy-space_308389320.htm"
  },
  {
    "title": "Major Banks Partner with Swift to Tackle ‘Last Mile’ Delays in Cross-Border Payments",
    "link": "https://fintechnews.sg/119345/payments/swift-cross-border-payments/",
    "guid": "https://fintechnews.sg/?p=119345",
    "pubDate": "2025-09-29T07:28:09.000Z",
    "author": "Fintech News Singapore",
    "categories": [
      "Payments",
      "SWIFT"
    ],
    "contentHtml": "<p>More than 30 global banks are teaming up with <a href=\"https://fintechnews.sg/tag/Swift\" target=\"_blank\" rel=\"noopener\">Swift</a> to end hidden fees and slow transfers, setting new rules for retail cross-border payments.</p>\n<p>Swift said it will launch a new scheme to make international transfers faster, more predictable and transparent for consumers and small businesses.</p>\n<p>Participating banks will provide upfront disclosure of fees, full-value transfers without hidden charges, end-to-end visibility and instant settlement where local infrastructure and rules allow.</p>\n<p>The initiative supports the G20’s 2027 roadmap for cross-border payments and builds on upgrades that have already sped up wholesale transactions.</p>\n<p>Today 75 percent of payments on Swift’s network reach beneficiary banks within 10 minutes, and the new rules are meant to bring the same experience to retail customers.</p>\n<p>Banks from 17 countries, including Bank of America, Deutsche Bank, ICICI Bank, JPMorgan Chase, OCBC Bank, Banco Santander, UOB and Wells Fargo, are among the first adopters.</p>\n<p>They will set the rules in stages and create mechanisms to ensure adherence over time.</p>\n<figure id=\"attachment_119365\" aria-describedby=\"caption-attachment-119365\" style=\"width: 150px\" class=\"wp-caption alignleft\"><img loading=\"lazy\" decoding=\"async\" class=\"size-thumbnail wp-image-119365\" src=\"https://fintechnews.sg/wp-content/uploads/2025/09/Thierry-Chilosi-150x150.jpg\" alt=\"Thierry Chilosi\" width=\"150\" height=\"150\" srcset=\"https://fintechnews.sg/wp-content/uploads/2025/09/Thierry-Chilosi-150x150.jpg 150w, https://fintechnews.sg/wp-content/uploads/2025/09/Thierry-Chilosi-300x300.jpg 300w, https://fintechnews.sg/wp-content/uploads/2025/09/Thierry-Chilosi-450x450.jpg 450w, https://fintechnews.sg/wp-content/uploads/2025/09/Thierry-Chilosi-96x96.jpg 96w, https://fintechnews.sg/wp-content/uploads/2025/09/Thierry-Chilosi.jpg 681w\" sizes=\"(max-width: 150px) 100vw, 150px\"><figcaption id=\"caption-attachment-119365\" class=\"wp-caption-text\">Thierry Chilosi</figcaption></figure>\n<p>Thierry Chilosi, Chief Business Officer at Swift, said,</p>\n<blockquote><p>“Swift has worked with its community over the past few years to significantly raise the bar on the cross-border payments experience. And now, together with the industry, we are bringing those same benefits to retail customers around the world.</p>\n<p>The new scheme will ensure that consumers and small businesses will experience fast and predictable international payments, whether sending money to family abroad or paying an overseas supplier.”</p></blockquote>\n<p>Swift said the project tackles last mile delays, which account for most of the time once a payment leaves its network.</p>\n<p>A new paper shows only about 20 percent of a typical transaction takes place on Swift, while 80 percent is spent in the last mile due to local regulations, infrastructure and practices.</p>\n<p>The scheme also builds on Swift Go and experience benchmarking for consumer channels.</p>\n<p>By extending its upgraded capabilities to retail payments, Swift and its partners aim to improve international transactions for around 4 billion accounts in more than 200 countries.</p>\n<p>&nbsp;</p>\n<p>&nbsp;</p>\n\n\n",
    "originImg": "https://www.swift.com/"
  }
]